//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.WriteLine("Введите пятизначное число. Проверим,является ли оно палиндромом");
int N = Convert.ToInt32(Console.ReadLine());
int[]array = new int[5];
int index = 0,
for (int i = 0, i < array.length, i++){0,0,0,0,0}
    if ((array[0] == array [4]) && (array[1] == array[3]))
{
    Console.WriteLine("Да"); 
}      
   

Console.WriteLine("Нет"); 



//if ((array[0] == array [4]) && (array[1] == array[3]))